tutorials/twoPopulationCrysPBEFoam/K2SO4Batch/0/moment.1.agglomerate
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object moment.1.agglomerate;
}
dimensions [0 -2 0 0 0 0 0];
internalField uniform 3000;
boundaryField
{
    walls { type zeroGradient; }
}
