tutorials/twoPopulationCrysPBEFoam/K2SO4Batch/0/moment.3.agglomerate
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object moment.3.agglomerate;
}
dimensions [0 0 0 0 0 0 0];
internalField uniform 0.0000825;
boundaryField
{
    walls { type zeroGradient; }
}
