tutorials/twoPopulationCrysPBEFoam/K2SO4Batch/0/moment.3.singleCrystal
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object moment.3.singleCrystal;
}
dimensions [0 0 0 0 0 0 0];
internalField uniform 0.0004125;
boundaryField
{
    walls { type zeroGradient; }
}
