tutorials/twoPopulationCrysPBEFoam/K2SO4Batch/0/moment.5.agglomerate
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object moment.5.agglomerate;
}
dimensions [0 2 0 0 0 0 0];
internalField uniform 2.70625e-12;
boundaryField
{
    walls { type zeroGradient; }
}
