tutorials/twoPopulationCrysPBEFoam/K2SO4Batch/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType laminar;
